tests/websocket-chat-load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalCount: 30
  variables:
    host: "http://localhost:8080"
    accessToken: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOjMsIm5pY2tuYW1lIjoic3RyaW5nIiwicHJvZmlsZSI6bnVsbCwicHJlZmVyVGVhbSI6IkxHIiwiaWF0IjoxNzMxOTA5ODUyLCJleHAiOjE3MzI1MTQ2NTJ9.xke55ec1Za9eVUelABFlnvIq8zBPlwDdvLqdXXjd_k4"
  socketio:
    auth:
      token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOjMsIm5pY2tuYW1lIjoic3RyaW5nIiwicHJvZmlsZSI6bnVsbCwicHJlZmVyVGVhbSI6IkxHIiwiaWF0IjoxNzMxOTA5ODUyLCJleHAiOjE3MzI1MTQ2NTJ9.xke55ec1Za9eVUelABFlnvIq8zBPlwDdvLqdXXjd_k4"

scenarios:
  - name: "WebSocket Test"
    engine: socketio
    flow:
      - log: "Start WebSocket Load Test"

      # 채팅방 생성
      - post:
          url: "/v1/chatrooms"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            gameId: 1
            title: "Test chatroom"
            preferTeam: "LG"
          capture:
            json: "$.id"
            as: "chatroomId"

      # pause
      - think: 1

      # 채팅방 연결
      - loop:
          - namespace: "/chat"
            emit:
              channel: "joinRoom"
              data: "{{ chatroomId }}"
          - think: 1
        count: 20

      # pause
      - think: 1

      # 채팅 전송
      - loop:
          - namespace: "/chat"
            emit:
              channel: "chat"
              data:
                chatroomId: "{{ chatroomId }}"
                content: "Chat Test Content"
          - think: "{{$randomNumber(1, 3)}}"
        count: 60

      # pause
      - think: 1

      # 채팅방 연결 해제
      - namespace: "/chat"
        emit:
          channel: "leaveRoom"
          data: "{{ chatroomId }}"

      # pause
      - think: 1

      # 채팅방 삭제
      - delete:
          url: "{{ host }}/v1/chatrooms/{{ chatroomId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"